app/views/core/choose_q1.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."selected" = 't' LIMIT 1
---
<% @selected_question = Question.find_by_selected(true) %>