app/controllers/core_controller.rb

  def show_question
    @title = "Current Question"
    @selected_question = Question.find_by_selected(true)
---
SELECT "questions".* FROM "questions" WHERE "questions"."selected" = 't' LIMIT 1

  def show_responses
    @title = "Summary of Responses"
    @selected_question = Question.find_by_selected(true)
---
SELECT "questions".* FROM "questions" WHERE "questions"."selected" = 't' LIMIT 1

  def choose_q1
    @selected_question = Question.find_by_selected(true)
    if @selected_question.score_ans1 == nil
      @selected_question.update_attribute(:score_ans1, 1)
---
SELECT "questions".* FROM "questions" WHERE "questions"."selected" = 't' LIMIT 1
UPDATE "questions" SET "score_ans1" = 1, "updated_at" = '2013-01-30 17:20:24.246984' WHERE "questions"."id" = 1

  def choose_q2
    @selected_question = Question.find_by_selected(true)
    if @selected_question.score_ans2 == nil
      @selected_question.update_attribute(:score_ans2, 1)
---
SELECT "questions".* FROM "questions" WHERE "questions"."selected" = 't' LIMIT 1
UPDATE "questions" SET "score_ans2" = 1, "updated_at" = '2013-01-30 19:59:29.985129' WHERE "questions"."id" = 1

  def choose_q3
    @selected_question = Question.find_by_selected(true)
    if @selected_question.score_ans3 == nil
      @selected_question.update_attribute(:score_ans3, 1)
---
SELECT "questions".* FROM "questions" WHERE "questions"."selected" = 't' LIMIT 1
UPDATE "questions" SET "score_ans3" = 1, "updated_at" = '2013-01-30 20:00:45.801317' WHERE "questions"."id" = 1